manual_exemplo_sistema_prefeitura/BlueprintPHP/XML/CancelarLoteRPS.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.e-governeapps2.com.br/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soap:Header/>
   <soap:Body>
      <e:CancelarLoteNfse>         
         <e:CancelarLoteNfseEnvio>            
            <e:LoteCancelamento>               
               <e:Cnpj>12345678000100</e:Cnpj>               
               <e:InscricaoMunicipal>1234567</e:InscricaoMunicipal>               
               <e:PedidosCancelamento>                  
                  <e:PedidoCancelamento>                     
                     <e:InfPedidoCancelamento>                        
                        <e:IdentificacaoNfse>
                           <e:Numero>2</e:Numero>                           
                           <e:Cnpj>12345678000100</e:Cnpj>                           
                           <e:InscricaoMunicipal>1234567</e:InscricaoMunicipal>
                           <e:CodigoMunicipio>4106902</e:CodigoMunicipio>
                        </e:IdentificacaoNfse>                        
                        <e:CodigoCancelamento>0</e:CodigoCancelamento>
                     </e:InfPedidoCancelamento>
                  </e:PedidoCancelamento>
               </e:PedidosCancelamento>
            </e:LoteCancelamento>
         </e:CancelarLoteNfseEnvio>
      </e:CancelarLoteNfse>
   </soap:Body>
</soap:Envelope>